       IDENTIFICATION DIVISION.
       PROGRAM-ID. say.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       LINKAGE SECTION.
       01 ARG1 PIC X(6).
       01 ARG2 PIC X(6).
       PROCEDURE DIVISION USING ARG1 ARG2.
       DISPLAY ARG1 " jkjk" ARG2.
       MOVE SPACES TO ARG2.
       MOVE "GO" TO ARG2
       EXIT PROGRAM.
